pmo-dataset/graphviz/21.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Special sandling?" -> "InclusiveGateway_1" [label="no"];
  "InclusiveGateway_1" -> "Insure parcel" [label="If insurance\nnecessary"];
  "InclusiveGateway_1" -> "Write package label" [label="always"];
  "Write package label" -> "InclusiveGateway_2";
  "Insure parcel" -> "InclusiveGateway_2";
  "Ship goods" -> "ParallelGateway";
  "ParallelGateway" -> "Clarify shipment\nmethod";
  "Clarify shipment\nmethod" -> "Special sandling?";
  "Special sandling?" -> "Get 3 offers from\nlogistic companies" [label="yes"];
  "Get 3 offers from\nlogistic companies" -> "Select logistic\ncompany and place\norder";
  "Select logistic\ncompany and place\norder" -> "ExclusiveGateway_1";
  "InclusiveGateway_2" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "ExclusiveGateway_2";
  "Package goods" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "Prepare for picking\nup goods";
  "Prepare for picking\nup goods" -> "Shipment prepared";
  "ParallelGateway" -> "Package goods";

  subgraph "cluster_Pool_1" {
    label="Dispatch of goods\nComputer Hardware\nShop";

    subgraph "cluster_Lane_1" {
      label="Logistics";
      "Insure parcel";
    }

    subgraph "cluster_Lane_2" {
      label="Secretary";
      "Write package label";
      "Clarify shipment\nmethod";
      "Get 3 offers from\nlogistic companies";
      "Select logistic\ncompany and place\norder";
      "InclusiveGateway_1";
      "InclusiveGateway_2";
      "Ship goods";
      "ParallelGateway";
      "Special sandling?";
      "ExclusiveGateway_1";
    }

    subgraph "cluster_Lane_3" {
      label="Warehouse";
      "Package goods";
      "Prepare for picking\nup goods";
      "ExclusiveGateway_2";
      "Shipment prepared";
    }
  }

  "Ship goods" [shape=circle];
  "Shipment prepared" [shape=circle, penwidth=4];
  "Special sandling?" [shape=diamond];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ParallelGateway" [label="+", shape=diamond];
  "InclusiveGateway_1" [label="O", shape=diamond];
  "InclusiveGateway_2" [label="O", shape=diamond];
}
